ХамелионЦРПТ/src/DataProcessors/ФормированиеАгрегацийНаОднуПозицию_ХамелеонЦРПТ/ФормированиеАгрегацийНаОднуПозицию_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ФормированиеАгрегацийНаОднуПозицию_ХамелеонЦРПТ</name>
</mdclass:DataProcessor>

ХамелионЦРПТ/src/AccumulationRegisters/ОстаткиКМ_в_Обороте_ХамелеонЦРПТ/ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКМ_в_Обороте_ХамелеонЦРПТ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ID_Строки</name>
    <type>
      <types>CatalogRef.ID_строки_партия_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ХамелионЦРПТ/src/Enums/ВидДокументаУпаковок_ХамелеонЦРПТ/ВидДокументаУпаковок_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДокументаУпаковок_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Формирование</name>
  </enumValues>
  <enumValues>
    <name>Расформирование</name>
  </enumValues>
  <enumValues>
    <name>ИзъятиеИзУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ДобавлениеВУпаковку</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Enums/СтатусыКМДляАгрегации_ХамелеонЦРПТ/СтатусыКМДляАгрегации_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКМДляАгрегации_ХамелеонЦРПТ</name>
  <enumValues>
    <name>КМВОбороте</name>
  </enumValues>
  <enumValues>
    <name>КМЭмитирован</name>
  </enumValues>
  <enumValues>
    <name>КМДоЭммитирования</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/Documents/СозданиеНовогоШкНаКороба_ХамелеонЦРПТ/СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СозданиеНовогоШкНаКороба_ХамелеонЦРПТ</name>
  <basedOn>Document.ВводВОборот_ХамелеонЦРПТ</basedOn>
  <basedOn>Document.ЗаказМарок_ХамелеонЦРПТ</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКМЭмитированые_ХамелеонЦРПТ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКМНеобходимоВвестиОтчетомОбИспользовании_ХамелеонЦРПТ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВКоробе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>_Order_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаОтправки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКороба</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ВидДокументаУпаковок_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКМ</name>
    <type>
      <types>EnumRef.СтатусыКМДляАгрегации_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧерезСУЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдПроизводственногоЗаказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусУпаковки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>GTINУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказДляФормированияНомераКОроба</name>
    <type>
      <types>DocumentRef.ЗаказМарок_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводВоборот</name>
    <type>
      <types>DocumentRef.ВводВОборот_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>РасформированиеКоробов</name>
    <type>
      <types>DocumentRef.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПалет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЛекарства</name>
    <type>
      <types>CatalogRef.Договора_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходитВГрупповую</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтарыйКороб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорты_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИзЗаказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерБокса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Продукция_ХамелеонЦРПТ</types>
      </type>
    </attributes>
    <attributes>
      <name>cis</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзъятьИзУпаковки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАгрегации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипУпаковки</name>
      <type>
        <types>EnumRef.Тип_КМ_ХамелеонЦРПТ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БылоДоЭтого</name>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерБокса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылканаДокумент</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МаркиОприходовать</name>
    <attributes>
      <name>Марка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКороба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НомераБлоков</name>
    <attributes>
      <name>НомерБлока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Агрегации</name>
    <attributes>
      <name>Агрегация</name>
      <type>
        <types>DocumentRef.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ХамелионЦРПТ/src/DataProcessors/ФормированиеАгрегацийНаОднуПозицию_ХамелеонЦРПТ/Forms/Форма/Module.bsl
&НаСервере
Процедура СоздатьАгрегацииНаСервере()
	// Вставить содержимое обработчика.
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	
	СписокИсключить=Новый СписокЗначений;
	Для Каждого Стр_1 Из Агрегации Цикл
		Для Каждого Стр_2 Из Стр_1.Агрегация.Марки Цикл
			
			СписокИсключить.Добавить(Стр_2.Марка);
		Конеццикла;
		
	Конеццикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ОстаткиКМ_в_Обороте_ХамелеонЦРПТОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	ОстаткиКМ_в_Обороте_ХамелеонЦРПТОстатки.СерийныйНомер КАК СерийныйНомер
		|ИЗ
		|	РегистрНакопления.ОстаткиКМ_в_Обороте_ХамелеонЦРПТ.Остатки(
		|			,
		|			Организация = &Организация
		|				И Продукция = &Продукция
		|				И НЕ СерийныйНомер В (&Номенклатура)) КАК ОстаткиКМ_в_Обороте_ХамелеонЦРПТОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиКМ_в_Обороте_ХамелеонЦРПТОстатки.СерийныйНомер
		|ИТОГИ
		|	СУММА(КоличествоОстаток)
		|ПО
		|	СерийныйНомер";
	
	Запрос.УстановитьПараметр("Организация", ТекущийПользователь.Организация);
	Запрос.УстановитьПараметр("Продукция", Продукция);
	Запрос.УстановитьПараметр("Номенклатура",СписокИсключить);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСерийныйНомер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Сч_КоличествоАгрегаций=КоличествоАгрегаций;
	
	КоличествоВоВл=КоличествоВАгрегации;
	
	Если КоличествоВоВл=0 Тогда
		КоличествоВоВл=1;
	КонецЕсли;
	Докум=Документы.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.СоздатьДокумент();
	Докум.Организация=ТекущийПользователь.Организация;
	Докум.ТекущийПользователь=ТекущийПользователь;
	Докум.ТипДокумента=Перечисления.ВидДокументаУпаковок_ХамелеонЦРПТ.Формирование;
	Докум.СтатусКМ=Перечисления.СтатусыКМДляАгрегации_ХамелеонЦРПТ.КМВОбороте;
	
	Докум.Дата=ТекущаяДата();
	Пока ВыборкаСерийныйНомер.Следующий() Цикл
		// Вставить обработку выборки ВыборкаСерийныйНомер
		
		Если КоличествоВоВл=0 Тогда
			КоличествоВоВл=КоличествоВАгрегации;
	
			Если КоличествоВоВл=0 Тогда
				КоличествоВоВл=1;
			КонецЕсли;
	        Докум.Записать();
			ДД=Агрегации.Добавить();
			ДД.Агрегация=Докум.Ссылка;
			
			Сообщить("Создан документ "+Строка(Докум.Ссылка));
			
			Сч_КоличествоАгрегаций=Сч_КоличествоАгрегаций-1;
			Если Сч_КоличествоАгрегаций=0 ТОгда
				Прервать;
			КонецЕсли;
			
			
			Докум=Документы.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.СоздатьДокумент();
			Докум.Организация=ТекущийПользователь.Организация;
			Докум.ТекущийПользователь=ТекущийПользователь;
			Докум.ТипДокумента=Перечисления.ВидДокументаУпаковок_ХамелеонЦРПТ.Формирование;
			Докум.СтатусКМ=Перечисления.СтатусыКМДляАгрегации_ХамелеонЦРПТ.КМВОбороте;
			
			Докум.Дата=ТекущаяДата();
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Докум.НомерКороба) Тогда
			Докум.Номенклатура=Продукция;
			Докум.Продукция=Продукция;
			ыыы="";
			Обработки._Запуск_ХамелеонЦРПТ.СформироватьСлучайныйКоробСервер(Докум,ыыы);
		КонецЕсли;
		
		Если ВыборкаСерийныйНомер.Количество()>0 Тогда
			Если СтрДлина(ВыборкаСерийныйНомер.СерийныйНомер)=18 Тогда
				Продолжить;
			КонецЕслИ;
			Добав=Докум.Марки.Добавить();
			Добав.Марка=ВыборкаСерийныйНомер.СерийныйНомер;
		
		//Докум.Записать(РежимЗаписиДокумента.Запись);
		
			КоличествоВоВл=КоличествоВоВл-1;
		
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьАгрегации(Команда)
	СоздатьАгрегацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Форм=ПолучитьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
	Если НЕ Форм.Открыта() Тогда
		Форм.Открыть();
	КонецЕсли;
	ТекущийПользователь=Форм.Пользователь;
КонецПроцедуры

Функция Орг()
	Возврат ТекущийПользователь.Организация
КонецФункции

&НаКлиенте
Процедура ПродукцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Справочник.Продукция_ХамелеонЦРПТ.Форма.ФормаВыбораКМ",Новый Структура("Организация",Орг()),Элемент,,,,Новый ОписаниеОповещения("ПослеВыбораПродукции",ЭтаФорма));
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПродукции(РР,ДД) Экспорт
	Если ЗначениеЗаполнено(РР) Тогда
		Продукция=РР;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СоздатьИОТправитьВЦРПТАгрегации(Команда)
	СоздатьАгрегацииНаСервере();
		
	ОтправитьАгрегации(Команда);
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьАгрегации(Команда)
	Для Каждого Стр_1 Из Агрегации Цикл
		Если ЗначениеЗАполненО(Стр_1.Агрегация) Тогда
			Форм=ПолучитьФорму("Документ.СозданиеНовогоШкНаКороба_ХамелеонЦРПТ.Форма.ФормаДокумента",
			Новый Структура("Ключ",Стр_1.Агрегация));
			Форм.ОтправитьВЦРПТ("");
		КонецЕсли;
		
	Конеццикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтветы(Команда)
	// Вставить содержимое обработчика.
	// Вставить содержимое обработчика.
	Обр=ОткрытьФорму("Обработка._Запуск_ХамелеонЦРПТ.Форма.Форма");
	Для Каждого Стр_11 Из Агрегации Цикл
		Обр.ОбновитьСтатусыДокументов(Команда,,,Стр_11.Агрегация);
		оповестить(Стр_11.Агрегация);
	Конеццикла;
	Попытка
		ЭтаФорма.ВладелецФормы.Активизировать();
	исключение
	КонецПопытки;
	ЭтаФорма.Активизировать();
	Элементы.Агрегации.Обновить();;
	
	
КонецПроцедуры
